This directory contains tests that test the /basic/ functionality of the policy.

Each policy file has it's own corresponding directory. For example the =pin-policy= directory contains tests for =policy/pin-package.cf=.

The tests expect to find the Masterfiles Policy Framework in =$(sys.libdir)=. They load necessary related policy files and emit the test results in JUnit format in the =artifacts= directory.

Some policy requires privileged execution and execution may produce errors. These errors do not fail the test unless otherwise noted.

For example the following test execution run unprivileged produces errors about setting ownership for the artifacts directory as well as the individual package pin configuration files but the test result is overall a success.

#+begin_src sh :results output :exports both
  exec 2>&1
  cf-agent -KIf ./pin-package/pin-package.cf
  :
#+end_src

Alternately, run all tests from top of this project:

#+begin_src sh :results output :exports both
  exec 2>&1
  ./ci/docker.sh 2>&1 | tee log
#+end_src

#+RESULTS:
#+begin_example
   error: Cannot set ownership on file '/home/nickanderson/src/nickanderson/cfengine-apt/tests/pin-package/artifacts'. (chown: Operation not permitted)
   error: Errors encountered when actuating files promise '/home/nickanderson/src/nickanderson/cfengine-apt/tests/pin-package/artifacts'
    info: Created file '/home/nickanderson/src/nickanderson/cfengine-apt/tests/pin-package/artifacts/apackage', mode 0644
    info: Updated file '/home/nickanderson/src/nickanderson/cfengine-apt/tests/pin-package/artifacts/apackage' with content '# Managed by CFEngine
Package: apackage
Pin: version 1.2.3
Pin-Priority: 999
'
   error: Method 'package_version_priority_pinned' failed in some repairs
   error: Method 'init' failed in some repairs
    info: Created file '/home/nickanderson/src/nickanderson/cfengine-apt/tests/pin-package/artifacts/zpackage', mode 0644
    info: Updated file '/home/nickanderson/src/nickanderson/cfengine-apt/tests/pin-package/artifacts/zpackage' with content '# Managed by CFEngine
Package: zpackage
Pin: version 1.2.3
Pin-Priority: 999
'
    info: Deleted file '/home/nickanderson/src/nickanderson/cfengine-apt/tests/pin-package/artifacts/apackage'
    info: Executing 'no timeout' ... '/bin/echo File for pinned package exists as expected'
  notice: Q: ".../bin/echo File ": File for pinned package exists as expected
    info: Last 1 quoted lines were generated by promiser '/bin/echo File for pinned package exists as expected'
    info: Completed execution of '/bin/echo File for pinned package exists as expected'
    info: Executing 'no timeout' ... '/bin/echo File for pinned package absent as expected'
  notice: Q: ".../bin/echo File ": File for pinned package absent as expected
    info: Last 1 quoted lines were generated by promiser '/bin/echo File for pinned package absent as expected'
    info: Completed execution of '/bin/echo File for pinned package absent as expected'
R: testing_ok_if: adding testing report for class test_pinned_package_config_file_present_repaired at position 1
R: testing_ok_if: adding testing report for class test_pinned_package_config_file_absent_repaired at position 2
    info: Created file '/home/nickanderson/src/nickanderson/cfengine-apt/tests/./pin-package/artifacts/test-result.xml', mode 0600
    info: Updated rendering of '/home/nickanderson/src/nickanderson/cfengine-apt/tests/./pin-package/artifacts/test-result.xml' from mustache template '/home/nickanderson/.cfagent/inputs/lib/templates/junit.mustache'
R: testing_generic_report: report summary: counts = 2/2/0/0/0 failed = {  }, passed = { "testing_test_pinned_package_config_file_present_repaired", "testing_test_pinned_package_config_file_absent_repaired" }, skipped = {  }, todo = {  }, failed = {  }; tests = [{"tap_message":"ok Test that config file for pinned package is present","test_message":"Test that config file for pinned package is present","test_offset":1,"testcase":"test_pinned_package_config_file_present_repaired"},{"tap_message":"ok Test that config file for pinned package is absent","test_message":"Test that config file for pinned package is absent","test_offset":2,"testcase":"test_pinned_package_config_file_absent_repaired"}]+[]+[]+[]
#+end_example
